Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/rp_ap.h
#define RP_AP_DBG_POW_STATE_XIP_SMALL_ACK0_RESET  _u(0x0)
#define RP_AP_DBG_POW_STATE_XIP_SMALL_ACK0_BITS   _u(0x00000002)
#define RP_AP_DBG_POW_STATE_XIP_SMALL_ACK0_MSB    _u(1)
#define RP_AP_DBG_POW_STATE_XIP_SMALL_ACK0_LSB    _u(1)
#define RP_AP_DBG_POW_STATE_XIP_SMALL_ACK0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RP_AP_DBG_POW_STATE_XIP_IS_PD
// Description : Indicates the power somain is fully powered down.
#define RP_AP_DBG_POW_STATE_XIP_IS_PD_RESET  _u(0x0)
#define RP_AP_DBG_POW_STATE_XIP_IS_PD_BITS   _u(0x00000001)
#define RP_AP_DBG_POW_STATE_XIP_IS_PD_MSB    _u(0)
#define RP_AP_DBG_POW_STATE_XIP_IS_PD_LSB    _u(0)
#define RP_AP_DBG_POW_STATE_XIP_IS_PD_ACCESS "RO"
// =============================================================================
// Register    : RP_AP_DBG_POW_STATE_SRAM0
// Description : This register indicates the state of the power sequencer for
//               the SRAM0 domain.
//               The sequencer timing is managed by the POWMAN_SEQ_* registers.
//               See the header file for those registers for more information on
//               the timing.
//               Power up of the domain commences by clearing bit 0 (IS_PD) then
//               bits 1-8 are set in sequence. Bit 8 (IS_PU) indicates the
//               sequence is complete.
//               Power down of the domain commences by clearing bit 8 (IS_PU)
//               then bits 7-1 are cleared in sequence. Bit 0 (IS_PU) is then
//               set to indicate the sequence is complete.
#define RP_AP_DBG_POW_STATE_SRAM0_OFFSET _u(0x00000010)
#define RP_AP_DBG_POW_STATE_SRAM0_BITS   _u(0x000001ff)
#define RP_AP_DBG_POW_STATE_SRAM0_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : RP_AP_DBG_POW_STATE_SRAM0_IS_PU
// Description : Indicates the power somain is fully powered up.
#define RP_AP_DBG_POW_STATE_SRAM0_IS_PU_RESET  _u(0x0)
#define RP_AP_DBG_POW_STATE_SRAM0_IS_PU_BITS   _u(0x00000100)
#define RP_AP_DBG_POW_STATE_SRAM0_IS_PU_MSB    _u(8)
#define RP_AP_DBG_POW_STATE_SRAM0_IS_PU_LSB    _u(8)
#define RP_AP_DBG_POW_STATE_SRAM0_IS_PU_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RP_AP_DBG_POW_STATE_SRAM0_RESET_FROM_SEQ
// Description : Indicates the state of the reset to the power domain.
#define RP_AP_DBG_POW_STATE_SRAM0_RESET_FROM_SEQ_RESET  _u(0x0)
#define RP_AP_DBG_POW_STATE_SRAM0_RESET_FROM_SEQ_BITS   _u(0x00000080)
#define RP_AP_DBG_POW_STATE_SRAM0_RESET_FROM_SEQ_MSB    _u(7)
#define RP_AP_DBG_POW_STATE_SRAM0_RESET_FROM_SEQ_LSB    _u(7)
#define RP_AP_DBG_POW_STATE_SRAM0_RESET_FROM_SEQ_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RP_AP_DBG_POW_STATE_SRAM0_ENAB_ACK
// Description : Indicates the state of the enable to the power domain.
#define RP_AP_DBG_POW_STATE_SRAM0_ENAB_ACK_RESET  _u(0x0)
#define RP_AP_DBG_POW_STATE_SRAM0_ENAB_ACK_BITS   _u(0x00000040)
#define RP_AP_DBG_POW_STATE_SRAM0_ENAB_ACK_MSB    _u(6)
#define RP_AP_DBG_POW_STATE_SRAM0_ENAB_ACK_LSB    _u(6)
#define RP_AP_DBG_POW_STATE_SRAM0_ENAB_ACK_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RP_AP_DBG_POW_STATE_SRAM0_ISOLATE_FROM_SEQ
// Description : Indicates the state of the isolation control to the power
//               domain.
#define RP_AP_DBG_POW_STATE_SRAM0_ISOLATE_FROM_SEQ_RESET  _u(0x0)
#define RP_AP_DBG_POW_STATE_SRAM0_ISOLATE_FROM_SEQ_BITS   _u(0x00000020)
#define RP_AP_DBG_POW_STATE_SRAM0_ISOLATE_FROM_SEQ_MSB    _u(5)
#define RP_AP_DBG_POW_STATE_SRAM0_ISOLATE_FROM_SEQ_LSB    _u(5)
#define RP_AP_DBG_POW_STATE_SRAM0_ISOLATE_FROM_SEQ_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RP_AP_DBG_POW_STATE_SRAM0_LARGE_ACK
// Description : Indicates the state of the large power switches for the power
//               domain.
#define RP_AP_DBG_POW_STATE_SRAM0_LARGE_ACK_RESET  _u(0x0)
#define RP_AP_DBG_POW_STATE_SRAM0_LARGE_ACK_BITS   _u(0x00000010)
#define RP_AP_DBG_POW_STATE_SRAM0_LARGE_ACK_MSB    _u(4)
#define RP_AP_DBG_POW_STATE_SRAM0_LARGE_ACK_LSB    _u(4)
#define RP_AP_DBG_POW_STATE_SRAM0_LARGE_ACK_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RP_AP_DBG_POW_STATE_SRAM0_SMALL_ACK2
// Description : The small switches are split into 3 chains. In the power up
//               sequence they are switched on separately to allow management of
//               the VDD rise time. In the power down sequence they switch off
//               simultaneously with the large power switches.
//               This bit indicates the state of the last element in small power
//               switch chain 2.
#define RP_AP_DBG_POW_STATE_SRAM0_SMALL_ACK2_RESET  _u(0x0)
#define RP_AP_DBG_POW_STATE_SRAM0_SMALL_ACK2_BITS   _u(0x00000008)
#define RP_AP_DBG_POW_STATE_SRAM0_SMALL_ACK2_MSB    _u(3)
#define RP_AP_DBG_POW_STATE_SRAM0_SMALL_ACK2_LSB    _u(3)
#define RP_AP_DBG_POW_STATE_SRAM0_SMALL_ACK2_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RP_AP_DBG_POW_STATE_SRAM0_SMALL_ACK1
// Description : This bit indicates the state of the last element in small power
//               switch chain 1.
#define RP_AP_DBG_POW_STATE_SRAM0_SMALL_ACK1_RESET  _u(0x0)
#define RP_AP_DBG_POW_STATE_SRAM0_SMALL_ACK1_BITS   _u(0x00000004)
#define RP_AP_DBG_POW_STATE_SRAM0_SMALL_ACK1_MSB    _u(2)
#define RP_AP_DBG_POW_STATE_SRAM0_SMALL_ACK1_LSB    _u(2)
#define RP_AP_DBG_POW_STATE_SRAM0_SMALL_ACK1_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RP_AP_DBG_POW_STATE_SRAM0_SMALL_ACK0
// Description : This bit indicates the state of the last element in small power
//               switch chain 0.
#define RP_AP_DBG_POW_STATE_SRAM0_SMALL_ACK0_RESET  _u(0x0)
#define RP_AP_DBG_POW_STATE_SRAM0_SMALL_ACK0_BITS   _u(0x00000002)
#define RP_AP_DBG_POW_STATE_SRAM0_SMALL_ACK0_MSB    _u(1)
#define RP_AP_DBG_POW_STATE_SRAM0_SMALL_ACK0_LSB    _u(1)
#define RP_AP_DBG_POW_STATE_SRAM0_SMALL_ACK0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RP_AP_DBG_POW_STATE_SRAM0_IS_PD
// Description : Indicates the power somain is fully powered down.
#define RP_AP_DBG_POW_STATE_SRAM0_IS_PD_RESET  _u(0x0)
#define RP_AP_DBG_POW_STATE_SRAM0_IS_PD_BITS   _u(0x00000001)
#define RP_AP_DBG_POW_STATE_SRAM0_IS_PD_MSB    _u(0)
#define RP_AP_DBG_POW_STATE_SRAM0_IS_PD_LSB    _u(0)
#define RP_AP_DBG_POW_STATE_SRAM0_IS_PD_ACCESS "RO"
// =============================================================================
// Register    : RP_AP_DBG_POW_STATE_SRAM1
// Description : This register indicates the state of the power sequencer for
//               the SRAM1 domain.
//               The sequencer timing is managed by the POWMAN_SEQ_* registers.
//               See the header file for those registers for more information on
//               the timing.
//               Power up of the domain commences by clearing bit 0 (IS_PD) then
//               bits 1-8 are set in sequence. Bit 8 (IS_PU) indicates the
//               sequence is complete.
//               Power down of the domain commences by clearing bit 8 (IS_PU)
//               then bits 7-1 are cleared in sequence. Bit 0 (IS_PU) is then
//               set to indicate the sequence is complete.
#define RP_AP_DBG_POW_STATE_SRAM1_OFFSET _u(0x00000014)
#define RP_AP_DBG_POW_STATE_SRAM1_BITS   _u(0x000001ff)
#define RP_AP_DBG_POW_STATE_SRAM1_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : RP_AP_DBG_POW_STATE_SRAM1_IS_PU
// Description : Indicates the power somain is fully powered up.
#define RP_AP_DBG_POW_STATE_SRAM1_IS_PU_RESET  _u(0x0)
#define RP_AP_DBG_POW_STATE_SRAM1_IS_PU_BITS   _u(0x00000100)
#define RP_AP_DBG_POW_STATE_SRAM1_IS_PU_MSB    _u(8)
#define RP_AP_DBG_POW_STATE_SRAM1_IS_PU_LSB    _u(8)
#define RP_AP_DBG_POW_STATE_SRAM1_IS_PU_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RP_AP_DBG_POW_STATE_SRAM1_RESET_FROM_SEQ
// Description : Indicates the state of the reset to the power domain.
#define RP_AP_DBG_POW_STATE_SRAM1_RESET_FROM_SEQ_RESET  _u(0x0)
#define RP_AP_DBG_POW_STATE_SRAM1_RESET_FROM_SEQ_BITS   _u(0x00000080)
#define RP_AP_DBG_POW_STATE_SRAM1_RESET_FROM_SEQ_MSB    _u(7)
#define RP_AP_DBG_POW_STATE_SRAM1_RESET_FROM_SEQ_LSB    _u(7)
#define RP_AP_DBG_POW_STATE_SRAM1_RESET_FROM_SEQ_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RP_AP_DBG_POW_STATE_SRAM1_ENAB_ACK
// Description : Indicates the state of the enable to the power domain.
#define RP_AP_DBG_POW_STATE_SRAM1_ENAB_ACK_RESET  _u(0x0)
#define RP_AP_DBG_POW_STATE_SRAM1_ENAB_ACK_BITS   _u(0x00000040)
#define RP_AP_DBG_POW_STATE_SRAM1_ENAB_ACK_MSB    _u(6)
#define RP_AP_DBG_POW_STATE_SRAM1_ENAB_ACK_LSB    _u(6)
#define RP_AP_DBG_POW_STATE_SRAM1_ENAB_ACK_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RP_AP_DBG_POW_STATE_SRAM1_ISOLATE_FROM_SEQ
// Description : Indicates the state of the isolation control to the power
//               domain.
#define RP_AP_DBG_POW_STATE_SRAM1_ISOLATE_FROM_SEQ_RESET  _u(0x0)
#define RP_AP_DBG_POW_STATE_SRAM1_ISOLATE_FROM_SEQ_BITS   _u(0x00000020)
#define RP_AP_DBG_POW_STATE_SRAM1_ISOLATE_FROM_SEQ_MSB    _u(5)
#define RP_AP_DBG_POW_STATE_SRAM1_ISOLATE_FROM_SEQ_LSB    _u(5)
#define RP_AP_DBG_POW_STATE_SRAM1_ISOLATE_FROM_SEQ_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RP_AP_DBG_POW_STATE_SRAM1_LARGE_ACK
// Description : Indicates the state of the large power switches for the power
//               domain.
#define RP_AP_DBG_POW_STATE_SRAM1_LARGE_ACK_RESET  _u(0x0)
#define RP_AP_DBG_POW_STATE_SRAM1_LARGE_ACK_BITS   _u(0x00000010)
#define RP_AP_DBG_POW_STATE_SRAM1_LARGE_ACK_MSB    _u(4)
#define RP_AP_DBG_POW_STATE_SRAM1_LARGE_ACK_LSB    _u(4)
#define RP_AP_DBG_POW_STATE_SRAM1_LARGE_ACK_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RP_AP_DBG_POW_STATE_SRAM1_SMALL_ACK2
// Description : The small switches are split into 3 chains. In the power up
//               sequence they are switched on separately to allow management of
//               the VDD rise time. In the power down sequence they switch off
//               simultaneously with the large power switches.
//               This bit indicates the state of the last element in small power
//               switch chain 2.
#define RP_AP_DBG_POW_STATE_SRAM1_SMALL_ACK2_RESET  _u(0x0)
#define RP_AP_DBG_POW_STATE_SRAM1_SMALL_ACK2_BITS   _u(0x00000008)
#define RP_AP_DBG_POW_STATE_SRAM1_SMALL_ACK2_MSB    _u(3)
#define RP_AP_DBG_POW_STATE_SRAM1_SMALL_ACK2_LSB    _u(3)
#define RP_AP_DBG_POW_STATE_SRAM1_SMALL_ACK2_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RP_AP_DBG_POW_STATE_SRAM1_SMALL_ACK1
// Description : This bit indicates the state of the last element in small power
//               switch chain 1.
#define RP_AP_DBG_POW_STATE_SRAM1_SMALL_ACK1_RESET  _u(0x0)
#define RP_AP_DBG_POW_STATE_SRAM1_SMALL_ACK1_BITS   _u(0x00000004)
#define RP_AP_DBG_POW_STATE_SRAM1_SMALL_ACK1_MSB    _u(2)
#define RP_AP_DBG_POW_STATE_SRAM1_SMALL_ACK1_LSB    _u(2)
#define RP_AP_DBG_POW_STATE_SRAM1_SMALL_ACK1_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RP_AP_DBG_POW_STATE_SRAM1_SMALL_ACK0
// Description : This bit indicates the state of the last element in small power
//               switch chain 0.
#define RP_AP_DBG_POW_STATE_SRAM1_SMALL_ACK0_RESET  _u(0x0)
#define RP_AP_DBG_POW_STATE_SRAM1_SMALL_ACK0_BITS   _u(0x00000002)
#define RP_AP_DBG_POW_STATE_SRAM1_SMALL_ACK0_MSB    _u(1)
#define RP_AP_DBG_POW_STATE_SRAM1_SMALL_ACK0_LSB    _u(1)
#define RP_AP_DBG_POW_STATE_SRAM1_SMALL_ACK0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RP_AP_DBG_POW_STATE_SRAM1_IS_PD
// Description : Indicates the power somain is fully powered down.
#define RP_AP_DBG_POW_STATE_SRAM1_IS_PD_RESET  _u(0x0)
#define RP_AP_DBG_POW_STATE_SRAM1_IS_PD_BITS   _u(0x00000001)
#define RP_AP_DBG_POW_STATE_SRAM1_IS_PD_MSB    _u(0)
#define RP_AP_DBG_POW_STATE_SRAM1_IS_PD_LSB    _u(0)
#define RP_AP_DBG_POW_STATE_SRAM1_IS_PD_ACCESS "RO"
// =============================================================================
// Register    : RP_AP_DBG_POW_OVRD
// Description : This register allows external control of the power sequencer
//               outputs for all the switched power domains. If any of the power
//               sequencers stall at any stage then force power up operation of
//               all domains by running this sequence:
//               - set DBG_POW_OVRD = 0x3b to force small power switches on,
//               large power switches off, resets on and isolation on
//               - allow time for the domain power supplies to reach full rail
//               - set DBG_POW_OVRD = 0x3b to force large power switches on
//               - set DBG_POW_OVRD = 0x37 to remove isolation
//               - set DBG_POW_OVRD = 0x17 to remove resets
#define RP_AP_DBG_POW_OVRD_OFFSET _u(0x00000018)
#define RP_AP_DBG_POW_OVRD_BITS   _u(0x0000007f)
#define RP_AP_DBG_POW_OVRD_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : RP_AP_DBG_POW_OVRD_DBG_POW_RESTART_FROM_XOSC
// Description : By default the system begins boot as soon as a clock is
//               available from the ROSC, then it switches to the XOSC when it
//               is available. This is done because the XOSC takes several ms to
//               start up. If there is a problem with the ROSC then the default
//               behaviour can be changed to not use the ROSC and wait for XOSC.
//               However, this requires a mask change to modify the reset value
//               of the Power Manager START_FROM_XOSC register. To allow
//               experimentation the default can be temporarily changed by
//               setting this register bit to 1. After setting this bit the core
//               must be reset by a Coresight dprst or a rescue reset (see
//               RESCUE_RESTART in the RP_AP_CTRL register above). A power-on
//               reset, brown-out reset or RUN pin reset will reset this control
//               and revert to the default behaviour.
#define RP_AP_DBG_POW_OVRD_DBG_POW_RESTART_FROM_XOSC_RESET  _u(0x0)
#define RP_AP_DBG_POW_OVRD_DBG_POW_RESTART_FROM_XOSC_BITS   _u(0x00000040)
#define RP_AP_DBG_POW_OVRD_DBG_POW_RESTART_FROM_XOSC_MSB    _u(6)
#define RP_AP_DBG_POW_OVRD_DBG_POW_RESTART_FROM_XOSC_LSB    _u(6)
#define RP_AP_DBG_POW_OVRD_DBG_POW_RESTART_FROM_XOSC_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RP_AP_DBG_POW_OVRD_DBG_POW_RESET
// Description : When DBG_POW_OVRD_RESET=1 this register bit controls the resets
//               for all domains. 1 = reset. 0 = not reset.
#define RP_AP_DBG_POW_OVRD_DBG_POW_RESET_RESET  _u(0x0)
#define RP_AP_DBG_POW_OVRD_DBG_POW_RESET_BITS   _u(0x00000020)
#define RP_AP_DBG_POW_OVRD_DBG_POW_RESET_MSB    _u(5)
#define RP_AP_DBG_POW_OVRD_DBG_POW_RESET_LSB    _u(5)
#define RP_AP_DBG_POW_OVRD_DBG_POW_RESET_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RP_AP_DBG_POW_OVRD_DBG_POW_OVRD_RESET
// Description : Enables DBG_POW_RESET to control the resets for the power
//               manager and the switched-core. Essentially that is everythjing
//               except the Coresight 2-wire interface and the RP_AP registers.
#define RP_AP_DBG_POW_OVRD_DBG_POW_OVRD_RESET_RESET  _u(0x0)
#define RP_AP_DBG_POW_OVRD_DBG_POW_OVRD_RESET_BITS   _u(0x00000010)
#define RP_AP_DBG_POW_OVRD_DBG_POW_OVRD_RESET_MSB    _u(4)
#define RP_AP_DBG_POW_OVRD_DBG_POW_OVRD_RESET_LSB    _u(4)
#define RP_AP_DBG_POW_OVRD_DBG_POW_OVRD_RESET_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RP_AP_DBG_POW_OVRD_DBG_POW_ISO
// Description : When DBG_POW_OVRD_ISO=1 this register bit controls the
//               isolation gates for all domains. 1 = isolated. 0 = not
//               isolated.
#define RP_AP_DBG_POW_OVRD_DBG_POW_ISO_RESET  _u(0x0)
#define RP_AP_DBG_POW_OVRD_DBG_POW_ISO_BITS   _u(0x00000008)
#define RP_AP_DBG_POW_OVRD_DBG_POW_ISO_MSB    _u(3)
#define RP_AP_DBG_POW_OVRD_DBG_POW_ISO_LSB    _u(3)
#define RP_AP_DBG_POW_OVRD_DBG_POW_ISO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RP_AP_DBG_POW_OVRD_DBG_POW_OVRD_ISO
// Description : Enables DBG_POW_ISO to control the isolation gates between
//               domains.
#define RP_AP_DBG_POW_OVRD_DBG_POW_OVRD_ISO_RESET  _u(0x0)
#define RP_AP_DBG_POW_OVRD_DBG_POW_OVRD_ISO_BITS   _u(0x00000004)
#define RP_AP_DBG_POW_OVRD_DBG_POW_OVRD_ISO_MSB    _u(2)
#define RP_AP_DBG_POW_OVRD_DBG_POW_OVRD_ISO_LSB    _u(2)
#define RP_AP_DBG_POW_OVRD_DBG_POW_OVRD_ISO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RP_AP_DBG_POW_OVRD_DBG_POW_OVRD_LARGE_REQ
// Description : Turn on the large power switches for all domains. This should
//               not be done until sufficient time has been allowed for the
//               small switches to bring the supplies up. Switching the large
//               switches on too soon risks browning out the always-on domain
//               and corrupting these very registers.
#define RP_AP_DBG_POW_OVRD_DBG_POW_OVRD_LARGE_REQ_RESET  _u(0x0)
#define RP_AP_DBG_POW_OVRD_DBG_POW_OVRD_LARGE_REQ_BITS   _u(0x00000002)
#define RP_AP_DBG_POW_OVRD_DBG_POW_OVRD_LARGE_REQ_MSB    _u(1)
#define RP_AP_DBG_POW_OVRD_DBG_POW_OVRD_LARGE_REQ_LSB    _u(1)
#define RP_AP_DBG_POW_OVRD_DBG_POW_OVRD_LARGE_REQ_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : RP_AP_DBG_POW_OVRD_DBG_POW_OVRD_SMALL_REQ
// Description : Turn on the small power switches for all domains. This switches
//               on chain 0 for each domain and switches off chains 2 & 3 and
//               the large power switch chain. This will bring the power up for
//               all domains without browning out the always-on power domain.
#define RP_AP_DBG_POW_OVRD_DBG_POW_OVRD_SMALL_REQ_RESET  _u(0x0)
#define RP_AP_DBG_POW_OVRD_DBG_POW_OVRD_SMALL_REQ_BITS   _u(0x00000001)
#define RP_AP_DBG_POW_OVRD_DBG_POW_OVRD_SMALL_REQ_MSB    _u(0)
#define RP_AP_DBG_POW_OVRD_DBG_POW_OVRD_SMALL_REQ_LSB    _u(0)
#define RP_AP_DBG_POW_OVRD_DBG_POW_OVRD_SMALL_REQ_ACCESS "RW"
// =============================================================================
// Register    : RP_AP_DBG_POW_OUTPUT_TO_GPIO
// Description : Send some, or all, bits of DBG_POW_STATE_SWCORE to gpios.
//               Bit 0  sends bit 0  of DBG_POW_STATE_SWCORE to GPIO 34
//               Bit 1  sends bit 1  of DBG_POW_STATE_SWCORE to GPIO 35
//               Bit 2  sends bit 2  of DBG_POW_STATE_SWCORE to GPIO 36
//               .
//               .
//               Bit 11 sends bit 11 of DBG_POW_STATE_SWCORE to GPIO 45
#define RP_AP_DBG_POW_OUTPUT_TO_GPIO_OFFSET _u(0x0000001c)
#define RP_AP_DBG_POW_OUTPUT_TO_GPIO_BITS   _u(0x00000fff)
#define RP_AP_DBG_POW_OUTPUT_TO_GPIO_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : RP_AP_DBG_POW_OUTPUT_TO_GPIO_ENABLE
#define RP_AP_DBG_POW_OUTPUT_TO_GPIO_ENABLE_RESET  _u(0x000)
#define RP_AP_DBG_POW_OUTPUT_TO_GPIO_ENABLE_BITS   _u(0x00000fff)
#define RP_AP_DBG_POW_OUTPUT_TO_GPIO_ENABLE_MSB    _u(11)
#define RP_AP_DBG_POW_OUTPUT_TO_GPIO_ENABLE_LSB    _u(0)
#define RP_AP_DBG_POW_OUTPUT_TO_GPIO_ENABLE_ACCESS "RW"
// =============================================================================
// Register    : RP_AP_IDR
// Description : Standard Coresight ID Register
#define RP_AP_IDR_OFFSET _u(0x00000dfc)
#define RP_AP_IDR_BITS   _u(0xffffffff)
#define RP_AP_IDR_RESET  "-"
#define RP_AP_IDR_MSB    _u(31)
#define RP_AP_IDR_LSB    _u(0)
#define RP_AP_IDR_ACCESS "RO"
// =============================================================================
#endif // _HARDWARE_REGS_RP_AP_H

